posts/things-to-do-in-zh.org
#+BEGIN_COMMENT
.. title: A personal Repo - Movies, Art and Things to Do
.. slug: things-to-do-in-zh
.. date: 2016-08-28 16:41:37 UTC+02:00
.. tags: perRep
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT

#+BEGIN_EXPORT html
<br>
<br>
#+END_EXPORT

This is a personal post where I keep some personal activities/places I
am aim to visit at some point.

I am further structuring this post. I am adding a movie
section. Moreover, I will start to briefly write some memories and
personal thoughts for the completed activities.

{{{TEASER_END}}}

* Movies

