posts/things-to-do-in-zh.org
** Watched

  - Pinocchio (Begnigni version and Del Toro version)

    --> update

  - Lion King 2 (Disney)

  - Atlantis (Diseny)

  - [[https://en.wikipedia.org/wiki/After_Life_(TV_series)][After Life]] (2019 - ):

    This is a Netflix series.

    Outstanding. I really like it. It teaches you to put things in
    perspective. The thing that you should be better able to deal
    with.

    It teaches you the importance of a full life. It teaches you the
    importance of the little things that you often forget in the life
    that you are living.

    It teaches you how hard life can hit. It teaches you to never
    surrender. To stay strong.

    It teaches you not to judge people by their status.

    On the top of it, it has a lot of humour such that it is greatly
    recommended. 

  - [[https://en.wikipedia.org/wiki/Tick,_Tick..._Boom!_(film)][Tick tick... Boom]] (2021):

    Nice movie because of the story. Also nice to see New York and be
    able to recognize all of the places. 

    It is as well possible to better understand what Broadway truly
    is. Maybe in this sense I did the wrong decision in going to watch
    one of the big classic. Next time I should rather go and watch
    something more modern and even an off-broadway one. 

    I think the music was not that great. The musical component in the
    way it was framed does give a light touch to the tragedy of the
    movie. I think that something in the process gets lost though. It
    could have been a more intense movie looking at the story without
    having much clue on the underlying character. 

    Maybe it was best depicted as that but this just people with a
    bigger knowledge of the person and events than me can say.

  - [[https://en.wikipedia.org/wiki/The_Hand_of_God_(film)][E stata la mano di Dio]] (2021):

    Another great movie of Paolo Sorrentino. After /La grande
    bellezza/ he hit the target again.

    A different movie. Less poetic. Less vanity. More sorrow.

    I think the movie is beautiful as is his message. Not clear, not
    straight, obscure as often in his movies.

    Everyone is free to interpret it his way. I like to think that the
    message of the movie is all in the 2 minutes when he talks with
    the movie director.

    For 90 min. Sorrentino shows us the /lousy world/. The one that we
    always have - one way or the other - to face and swollow.

    And then suddenly, that 5 min. talking. That message:

    do not break down.

    do not loose your integrity.

    do not come undone.

    that /"non ti disunire"/.
   
  - [[https://zff.com/en/archive/85998/][All these Sons]] (2021):

    Very beautiful, went there with friends at the zurich film
    festival. 

    It was beautiful cause even two protagonists of the movie were
    present after the movie for a Q&A session.

    Incredible what is still happening in 21st century. Every time you
    think that racial issues are over. But than badaboom. You
    understand that you live in a bubble. That realities very far from
    your own one exists. Rough realities, were that some sporadic
    heros try to make better.

    Also interesting how they approach everything as a fight of will
    and how they simply push the young people to look at themselves
    differently. All the rest will follow. A rethoric I highly agree
    with, as I think that things are not difficult to do. Everything
    is a matter of will; it's just that finding the will and the
    motivation for doing things in a difficult world like ours is not
    always that easy.

  - [[https://www.youtube.com/watch?v=0hF5HnVdIqI][Rue 8 de l'Humanite]] (2021):

    Alors, très jolie le film.

    Très amusant - il respect la traditionne de le cinèma fracaise.

    Quand je l'avais regarde, j'ai eu un coup. Il n'est pas possible
    que on avait vraimont vécu cette historie.

    Ancor plus amusant était le fait que le même jour que j'avais regarde
    le film avec mes pensées délirantes - j'avais mon premiers
    symptômes du coronavirus. J'ai été testé positif le lendemain.

    Encroyable... 

  - [[https://en.wikipedia.org/wiki/Shtisel][Shtisel]] (2021):

    I was home over Easter. I watched with the family the third
    season. Very nice series. Much better than [[https://de.wikipedia.org/wiki/Unorthodox_(Miniserie)][unorthodox]]. There
    everything was a little bit too much exasperated.

    This is nice. I would say it's kosher. It well summarizes the
    Jewish mentality with all its pro and cons.
    
  - [[https://www.youtube.com/watch?v=aKtvrvZC8OY][Il mondo che vorrei]] (2021):

    This was an interview with [[https://it.wikipedia.org/wiki/Papa_Francesco][Pope Francesco I]]. It was a good
    watch. In a rough world that is hard to navigate is always good to
    listen to such people reminding the true christian values on which
    the western society build on. These are not values augmenting the
    individualism but rather stressing the importance of the community
    that we must protect and remind us.

    The message was centered about fostering a culture of /us/ in
    contrast to an /egocentric/ view, in promoting a culture where we
    have [[https://www.youtube.com/watch?v=fhVsgxlYsEA][empathy]] and care for the others. In refusing a culture of
    waste, where if we do not like something, if something creates a
    problem or if something/someone does not fit, well we throw it
    away, be it a human being or a thing, instead of trying to solve
    the problem with it.

    Good fellow as always Pope Francesco, may he stay healthy.

  - [[https://www.youtube.com/watch?v=BHi-a1n8t7M][Marriage Story]] (2020):

    Another wow movie. You should remember this when marrying. It
    describes in a terrific way how things can go wrong for little
    reasons. I mean simply time and divergence of opinions. Things
    that you can hardly predict in advance. And still there is love
    but auto-destruction kicks in and there is nothing you can do
    while you are absorbed by spiral. 

  - [[https://en.wikipedia.org/wiki/Rose_Island_(film)][L'isola delle rose]] (2020):

    Wow! What an incredible story. I love it. It is a daydreamer story
    like me. Makes well the point of the italian genius. It lives in a
    different dimension. We idealist animals...

  - [[https://www.youtube.com/watch?v=En1jkf34xjc][La vita davanti a sé]] (2020):

    Very good movie. Strong like Momo. It is a very mixed movie. It
    encompasses many feelings and it is much food for thoughts. There
    is not a bottom line to it and it is not a light watch where there
    not need to be a bottom line. 

    It is difficult to write a snippet summarizing it. I liked it. One
    of the things I liked was the power of Momo. I guess that a key in
    the movie is how the energy of such people when channeled in the
    right will make them shine. The weird element of the lion in the
    movie goes in this direction. There is a lion / fire in some
    people and it can turn to very good or bad outcomes depending on
    who is there in the path of such people - be it Madame Rosa or the
    other guy.

    Interesting is also to notice that not the spoiled child, but
    rather the suffered one will have the fire. Help such people and
    let them shine.

  - [[https://www.youtube.com/watch?v=SMuQfYdgWxw][Sorelle Macaluso]] (2020):

    Wow wow wow!!! There are film directors that do movies. They stay in
    the daily life of each of us and touch daily topics. Mundane - I
    think this is the word.

    This transcends everything. What a beautiful mind the one of the
    movie director. To get the gravity of the life and what each one
    of us needs to face in our life and bring it on the big screen in
    such a way is simply... wow. And the lyrics that goes along the
    movie. It's liberty music. Despite the hard life we are able to
    face it and go on with such a power. Crazy movie. Possibly one of
    the best, if not the best I ever saw.

    And I usually do not touch or go along the female vs male story. I
    do not like dichotomies. But damn it you feel the touch of a
    female soul in the movie. And if this is what we missed, give way
    to the woman on the big screen.

  - [[https://en.wikipedia.org/wiki/Marriage_Story][Marriage Story]] (2019):

    Beautiful movie. I like it cause it treats the drama of the end of
    a love story in a realistic way.

    Too often people want to set reasons in cases where no reason
    exists. The beauty of the movie lies here. It shows how love
    between people can end because of divergence of opinion and how if
    not faced in the correct way can be extremely disruptive.

    It points out to the importance of being mature and to let things
    go the way they are. 

  - [[https://www.youtube.com/watch?v=RUOH8_HYDtA][Cyrano mon Amour]] (2019):

    Good movie. Confirms my personal opinion about French movies:
    these are generally the best movies when you look for a light but
    tasty watch. The key of the French majesty of movies production is
    to bring deep stories in a light way to the viewer while keeping
    the importance of the message in the movie.

    Here and there this specific movie falls into some mainstream,
    which might hurt some more sophisticated viewer but generally a
    good watch that underlines how sometimes the best in life does not
    come by following rigid structures. 

    Have to watch the Cyrano at some Opernhaus at some point now..

    Also interesting is that now you can understand better [[https://www.youtube.com/watch?v=T_wnAnIM3cw][the song of
    Guccini]]. I understood the power of the text but some links where
    missing and now it clicked.

  - [[https://www.youtube.com/watch?v=5UijUOy0MmE][The Spy]] (2019):

    Another interesting story that is Israeli-related.

    Another interesting testimony of the effort of the Israeli society
    and its people in order to keep the Israeli dream alive.

    Unfortunately, other blood that flew - todah Eliyahu Ben-Shaul
    Cohen.

  - [[https://it.wikipedia.org/wiki/Old_Man_%26_the_Gun][The Old Man & The Gun]] (2018):

    Nice movie and watch. It teaches the importance of elegance and
    style in life. That demeanor that everyone wants to have but just
    a few achieve. It is funny as basically in the plot the demeanor
    of the person completely excuses his acts. You and everyone in the
    movie sympathize with him.

    Just a pity for the end. He did not reach maturity and it lives
    you with the doubt that guy was just a psycho. But maybe it was
    just in his style and that is the beauty of it. Throwing
    everything away to save this little but important thing of
    yours.


  - [[https://www.youtube.com/watch?v=QkZxoko_HC0][Green Book]] (2018):

    Very nice movie. It shows how narrow minded people can easily
    be.. Talking and acting just based on habits and norms without
    questioning the system and going further. There is a convenience
    in doing that, which is undeniable. Best things happen though if
    you managed to transcend it.

    Also very important the motive of dignity in Doc. Shirely.

    I liked a lot in this sense the quote

    #+begin_quote
    You Never Win With Violence. You Only Win When You Maintain Your Dignity.
    #+end_quote

    beautiful idea and yet so difficult to maintain.

  - [[https://www.youtube.com/watch?v=CGzKnyhYDQI][Loving Vincent]] (2017):

    Nice movie. It is kind of a thriller. Recommended watch, just
    because of the particular painting style it is recommended.

    It is also a nice watch in the sense that you get easily
    transported. 

    Interesting way to talk about Van Gogh in this particular indirect
    way. I think at the end they well manage to give a picture of him.

  - [[https://en.wikipedia.org/wiki/Il_a_d%C3%A9j%C3%A0_tes_yeux][Il a déjà tes yeux]] (2017):

    Very nice movie. Extremely funny. I love Manu. But also serious in
    the topic. Without ever being too heavy. Very recommended.

  - [[https://www.youtube.com/watch?v=MYzFieit8dI][Mayerowitz Stories]] (2017):

    Well, there are many movies. Some are different. This is one of
    these. Some movies you know from the very beginning what it is
    gonna come. This not. It evolves and evolves and evolves and then
    it finishes.

    It's a nice family story.

  - [[https://www.youtube.com/watch?v=NRADS6wT3nc][Bienvenue à Marly-Gomont]] (2016):

    It talks about a nice story. It is a story about
    integration. Again a typical french comedy. Sometimes fun,
    sometimes serious and in general a very pleasant and constructive
    watch.

    The message of the story is the usual. But it is always good to
    watch one more movie making the point. Myself as emigrant know
    the point. Every time when moving out and entering a new
    community you will face opposition. Don't think it is personal it
    is just how the world spins. And if you are bright enough then you
    will have the courage and the duty to oppose such mechanism and
    promote different outcomes like the one in the movie. 

  - [[https://www.youtube.com/watch?v=dKYaEPdcV1g&t=3s][War Dogs]] (2016):

    Dark comedy crime movie. Interesting cause it is based on a true
    story. I generally do not like such kind of movies as they make
    the watcher sympathize on bad behaviour by making it /hollywood
    cool/. At the end you enjoy watching it but it is a double edge
    sword for the reasons above. If you read it by taking a step back,
    there is a learning also in such movie in how even an apparently
    good soul as David gets easily tricked by the moment and takes up
    bad habits. We all had that kind of Efraim friend.

    So bottom line always remember that you are walking on thin ice
    and it is easy to get out of track. Keep faith and stay solid on
    good values.

  - [[https://en.wikipedia.org/wiki/Whiplash_(2014_film)][Whiplash]] (2014):

    This is a movie that I watched on some plane when traveling
    somewhere. Looking at the date it went out, it was probably during my first
    travel to the United States when I visited the west coast.

    Strange animal the memory. Out of the blue. In 2022 during my solo
    travel - after sailing, at the time of Grenada when I had quite some spare time -
    I had suddenly to watch this movie again. So this says a lot about
    the power of this movie and how much it sticks around inside a
    person. 

    So turning to a brief comment of it as usual. 

    Nice movie. Clear plot and lots of tension. 

    The general question that remains open at the end is the
    following: 

    Is Fletcher behaviour justifiable? Does it makes sense the way he
    thinks and behaves? 

    And on the top of it - is Neiman intelligent? Or let's rather use
    a more appropriate word instead of the much abused /intelligent/
    one: /stable/. 

    Is Neiman stable enough to be with a character like Fletcher? Does
    Fletcher have enough empathy to set the proper limits when pursuing
    his story-line?

    I think this is the correct line of reasoning. I personally like
    people that push. I try to push myself. So essentially I do not
    condemn Fletcher idea. But I also believe in emotional
    intelligence and that humans have to be /good/ 
    to the core. None of this was shown by Fletcher. This is the
    /tragedy/ of the movie. A /fragile/ kid in the hands of a person
    just focused in the pursuit of his goal that does not take the human
    side into account. 

    I also like to read the comment on youtube to see what people
    [[https://www.youtube.com/watch?v=ZZY-Ytrw2co][think]]. Very interesting the debate around the final. Is it a
    tragedy? Is it a victory? 

    People even start to talk about hedonism. Much fun to see the
    philosopher come out.

  - [[https://www.youtube.com/watch?v=4RI0QvaGoiI][Notting Hill]] (1999):

    Nice movie. With the magic British touch. I think that even more
    interesting than the classical love story of the movie is the
    friendship among the librarian's group of friends.

    It was so sincere with that British humor. I think that this is
    one of the greatest strength of the brits people. They are not
    picky and can see tragedies with different lenses.

    I would sign a paper to be able to make such jokes and laugh with
    my dearest friends when life will make me feel miserable. 
  
  - [[https://www.youtube.com/watch?v=oYTfYsODWQo][Stand by me]] (1986):

    I never had any friends later on like the ones I had when I was
    twelve. Jesus, does anyone?

    Good sentence as an end of the movie. Movie telling a simple
    story. No big surprises. But still good. This is what simple
    stories telling a piece of every child life can achieve. There is
    no message but still the story is powerful. And the end makes the
    message in the end, with a sentence - at the end. Nice movie.

  - [[https://www.youtube.com/watch?v=9GzCG6lpFUw&t=57s][Vacanze Romane]] (1953):

    Was nice to see such an old movie. The story is outdated as in
    2020 no one would ever come up with such a story. These were
    rather fights from a previous generation.

    Or maybe I guess that in some countries you would still have such
    a story, what is different however is how the movie would be
    interpreted. It would be more scenographic today, the message
    would be more aggressive, more direct. 

    This is a thing that I think got lost with respect to older
    movies. They were more elegant and romantic. I do not know if it
    was due to the fact that there was a different way to live the
    public dimension in that age. They were different and this
    difference emerges when watching such an old movie.

    It reminded me of my grand-dad, he used to have some of this
    gentleman demeanor that is a leitmotiv in the movie. It got lost,
    for better or for worse, replaced by a young wilder generation.


