posts/things-to-do-in-zh.org
** Possible Watch

  - Pan's labyrinth - I think that with the new consciousness that
    might be a very very interesting view. 

  - [[https://www.youtube.com/watch?v=ikvO2I_wj5s][otto e mezzo]].

  - [[https://en.wikipedia.org/wiki/The_Highwaymen_(film)][The Highwaymen]] - story of bonnie and clyde - recent movie about it
    by Netflix. Must be good. Have heard of it a couple of times by
    now. It is a story that stays in the general memory o fthe
    people. So should be interesting. 
    
  - check movies of Wes Anderson. I have no idea how he is. But one
    guy said that the /new slang/ song of the shins could fit well
    into a movie of his. I love this song deeply. So I must at least
    check a movie of his. Sounds logic - doesn't it??
    
  - The Secret Life of Walter Mitty

  - Il tempo delle mele

  - https://en.wikipedia.org/wiki/BoJack_Horseman
    

* Books

