cache/posts/things-to-do-in-zh.html


<div id="outline-container-org9b6889f" class="outline-3">
<h3 id="org9b6889f">Possible Watch</h3>
<div class="outline-text-3" id="text-org9b6889f">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=ikvO2I_wj5s">otto e mezzo</a>.</li>

<li><a href="https://en.wikipedia.org/wiki/The_Highwaymen_(film)">The Highwaymen</a> - story of bonnie and clyde - recent movie about it
by Netflix. Must be good. Have heard of it a couple of times by
now. It is a story that stays in the general memory o fthe
people. So should be interesting.</li>

<li>check movies of Wes Anderson. I have no idea how he is. But one
guy said that the <i>new slang</i> song of the shins could fit well
into a movie of his. I love this song deeply. So I must at least
check a movie of his. Sounds logic - doesn't it??</li>

<li>The Secret Life of Walter Mitty</li>

<li>Il tempo delle mele</li>

<li><a href="https://en.wikipedia.org/wiki/BoJack_Horseman">https://en.wikipedia.org/wiki/BoJack_Horseman</a></li>
</ul>
</div>
</div>
</div>
