cache/posts/things-to-do-in-zh.html


<div id="outline-container-org6b417b1" class="outline-2">
<h2 id="org6b417b1">Books</h2>
<div class="outline-text-2" id="text-org6b417b1">
</div>
<div id="outline-container-org083140c" class="outline-3">
<h3 id="org083140c">Read</h3>
<div class="outline-text-3" id="text-org083140c">
<ul class="org-ul">
<li><p>
<a href="https://www.amazon.com/Leaders-Richard-Nixon/dp/0446512494">Leaders</a> (Richard Nixon):
</p>

<p>
TODO - write about it.
</p></li>

<li><p>
<a href="https://books.google.ch/books/about/My_Promised_Land.html?id=8fdvAgAAQBAJ&amp;source=kp_book_description&amp;redir_esc=y">My Promised Land</a> (Ari Shavit):
</p>

<p>
TODO - write about it.
</p></li>

<li><p>
<a href="https://en.wikipedia.org/wiki/The_Hummingbird">Il Colibri</a> (Sandro Veronesi):
</p>

<p>
TODO - write about it.     
</p></li>

<li><p>
<a href="https://it.wikipedia.org/wiki/Povera_gente">Povera Gente</a> (Fedor Dostoevskij):
</p>

<p>
TODO - write about it.     
</p></li>

<li><p>
<a href="https://it.wikipedia.org/wiki/Le_notti_bianche">Le Notti Bianche</a> (Fedor Dostoevskij):
</p>

<p>
TODO - write about it.
</p></li>

<li><p>
<a href="https://en.wikipedia.org/wiki/Letter_to_His_Father">Brief an den Vater</a> (Franz Kafka):
</p>

<p>
So this is a great piece. I liked it better in comparison to the
Trial.
</p>

<p>
You note how sharp the mind of Franz is here. When you read a
book of him it is always about a thrid party. There might be
something in it but there is always a certain degree of
detachment in it.
</p>

<p>
When people write something that is that personal it is
different. You immediately notice and get all of the struggles
and uncertainties of the person when reading the letters.
</p>

<p>
You immediately feel how difficult it must be to rise up next to
such invasive personalities. On the other hand you see how much
of the sorrow is caused in wanting to satisfy such
personalities. You need to kill the figure so to say in order to
fully be free and make your road in your life. You have to get
rid from the chains so to say.
</p>

<p>
Anyways that is pretty much it. I must also refer to the part
where he talks about the jewish religion. Was smiling a lot when
listening to it, experienced much of it on my skin and I must say
that he put it down in a wonderful way. I think that in this
sense he is missing still the bigger picture that you just get
when you get more into it but I must say that if you experience
jewishness in a very mild and superficial way as many secular
jews do, than the feeling is exactly that one. 
</p></li>

<li><p>
<a href="https://en.wikipedia.org/wiki/The_Trial">The Trial</a> (Franz Kafka):
</p>

<p>
Difficult book. I found it quite slow and heavy at times. I guess
this is necessary in order to deliver the message of the book and
give us this feeling of oppression that Josef K. is living.
</p>

<p>
I get it but, <i>oh boy what a book</i>. Did not expect something as
this from one of the most acclaimed books of a well known author
as Kafka.
</p>

<p>
Now turning to the book, it is a great piece of book in the
end. I mean not the lightest, not the most pleasant to read but
it surely gives you something.
</p>

<p>
The entire book you are waiting for something to
happen. Something that would give sense to all of the
book. Something that will eventually make cristal clear what is
happening.
</p>

<p>
This does not eventually come.
</p>

<p>
I think this is a bit the message of the book. You see Josef who
is a bright thinker. And you see how he does not manage to get
out of his troublesome situation, getting ultimately acquainted
to the trial to the point where he starts thinking of guilt.
</p>

<p>
To the point where his energies are gone. To the point where he
ruins himself. To the point where the mechanic of an
incomprehensible machine of the world defeats him.
</p>

<p>
Make sure you do not end in a similar way. You are experiencing
yourself these very mechanism that Kafka talks about. It is not a
trial but the mechanism of the trial are very well present in our
everyday life. So how to manage to break out from them and the
non-sense? To break out from the inertia.
</p></li>

<li><p>
<a href="https://en.wikipedia.org/wiki/White_Nights_(short_story)">White Nights</a> (Fyodor Dostoevsky):
</p>

<p>
Nice, short and juicy.
</p>

<p>
I guess that this is the reason why Dostoevsky entered the
Olympus of the Russian literature. You are just transported into
the narration.
</p>

<p>
The fact that all of the book is narrated in first person helps
you to really feel as being there, as being the person.
</p>

<p>
I mean it is different to the books that I usually read. Usually
I like to read books that leave you with some new insight. With
some new concept to think about, with something new.
</p>

<p>
This is not that kind of book.
</p>

<p>
It is just a book telling a simple story that lets you feel the
emotions of the character narrating his story.
</p>

<p>
It is emotions that everyone already experienced at least one in
his life such that it is easy to get the message.
</p>

<p>
I must say that I liked it but yeah nothing to say more than
it. Just a nice story to read and get transported into.     
</p></li>

<li><p>
<a href="https://www.amazon.com/Israel-Concise-History-Nation-Reborn/dp/0062368745">Israel - A Concise History of a Nation Reborn</a> (Daniel Gordis):
</p>

<p>
So very nice book. Nothing to say.
</p>

<p>
It delivers what it promises in its title.
</p>

<p>
Well written, easy to follow and it gives a great overview of all
the difficulties the young state had to go through.
</p>

<p>
Its dilemmas. Its most defining events.
</p>

<p>
Its tragedies and internal conflicts.
</p>

<p>
The difficult decisions that ought to be made.
</p>

<p>
The character of the nation.
</p>

<p>
Very recommended book in order to better understand the history
of the country. Gives you quite some picture and it is easy to
follow as well structured as opposed for instance to the
biography of Ben Gurion. 
</p></li>

<li><p>
<a href="https://www.amazon.com/Letters-Jonathan-Netanyahu-Commander-Entebbe/dp/9652292672">Letters of Jonathan Netanyahu</a> (Johnathan Netanyahu):
</p>

<p>
What to say. Possibly the greatest book I have ever read. 
</p>

<p>
Many books try to push our mindset in one direction or the
other. Make us do some required bit of philosophy or enlarge our
knowledge. 
</p>

<p>
This is different. It elevates the spirit in all of us. It is
simply a collection of letters that were not even meant to be
published. 
</p>

<p>
They tell the story of a man. A great man. That reminds us how
important it is to have purpose in life. 
</p>

<p>
The thing that strikes most about him is the degree of
emotional intelligence and of lateral view. On the top of it
impossible not to stress how he was focused on the essential
things in life. Mundane topics were far from him. A man with
something to tell. A man with a purpose.
</p>

<p>
A raw model for every one of us. Thank you for having been Jonathan.
</p></li>

<li><p>
<a href="https://it.wikipedia.org/wiki/Uno,_nessuno_e_centomila">Uno, Nessuno, Centomila</a> (Luigi Pirandello):
</p>

<p>
Very beautiful book. Read it during the quarantine. The time I
cought covid and had to stay by myself for 10 days.
</p>

<p>
I must say this is not the best book to read during the
qurantine. This due to its disruptive message. You might question
too much when being confronted with such a big topic staying all
alone in your house.
</p>

<p>
The message is beautiful. It touches one the vanity of the
human. It touches the mechnics of life. And how a person that
refuses the cerimony we are all bounded to live in is declared as
a madman.
</p>

<p>
I especially liked the chapter on the nature. Where he escapes in
the countryside and starts to make a critique to modern cities and
societies. Very deep and very true. Refer to it <a href="https://marcohassan.github.io/bits-of-experience/posts/book-wisdom/">here</a>.
</p></li>

<li><p>
<a href="https://www.amazon.de/confine-del-futuro-dellintelligenza-artificiale-ebook/dp/B07P5TVJVB">Il Confine del Futuro</a> (Francesca Rossi):
</p>

<p>
So particular book. If you want to go in the nitty-gritty of the
topic that is not the right book for you. It is quite high-level
and this is the reason why it has average reviews on Amazon.
</p>

<p>
I must say that I partly agree with the people. On the one hand,
you can clearly see that the author did not go the extra mile in
writing the book but simply leveraged the name, the position, and
the buzz for the topic for selling the book. In this sense there
is a bit too much of auto-reference that when not backed by
interesting content might hurt some reader. That was proved by the
Amazon reviews, nobody likes ego-centric people.
</p>

<p>
On the other hand, you might appreciate that is so high
level. After all the author already excuses at the beginning for
it and tells the public that is interested in the specifics of the
subject to search for handbooks somewhere else. I can understand
it, that is the ultimate difference between a <i>textbook</i> and a
<i>book</i>. Moreover, I think that there is value even in a
non-obsessed and 100%-effort book or writing. After all, in such a
way it is possible to write quick and dirty content going to the
gist of the problem without loosing too much time on petty
details. Of course you should have the skills to do that but I
think that the author has the authority to do that.
</p>

<p>
In this sense I think that the author manages well to bring some
<i>meta-level</i> thinking when talking about AI and machine
learning. This is typical of italian people, we are platonic by
education.
</p>

<p>
When thinking in these terms, I think that it is possible to say
that it is a good book - it manages well to reach what a textbook
cannot get - a high level, non-complicated, overview of the topic.
</p>

<p>
In this sense, I found of particular interest in the book the
following elements:
</p>

<ul class="org-ul">
<li><p>
the difference between slow and fast thinking.
</p>

<p>
I like that differentiation and I never thought about it in such
an explicit way. <a href="https://www.orellfuessli.ch/shop/home/artikeldetails/ID28756725.html">There is a book</a> that goes over it - probably I
should read it nextish.
</p>

<p>
That is a very nice concept that I immediately applied to the
book when reading it. It is kind of interesting how all of the
concepts expressed in the book are nothing new to anyone working
or dealing with AI/machine learning/applied
statistics.
</p>

<p>
Nonetheless, we get acquainted about all of that common
knowledge as a side effect of doing some work; i.e. we get it in
the fast way of thinking without making it ever explicit. While
in contrast when you read a 100-pages book expressing all of
that common knowledge you are forced to start your slow thinking
process about the topics. Even more when writing a post about it
later then. This activates an entire different way of thinking
about it and it raises new consciousness.
</p></li>

<li><p>
the macro-level differentiation between machine-learning
(learning by example) and the procedural learning (learning by
fix-rule).
</p>

<p>
I think that this differentiation is of particular importance
even if the line gets sometimes blurry when you think about
it. After all everything is a set of instructions - a procedural
learning - and it is not always as easy the difference. You
might well think of machine learning algorithms as being
deterministic, as a well specified set of rules apply to them.
</p>

<p>
This is also where I think that the general public confusion
occurs when talking about black-box.
</p>

<p>
A black-box simply occurs when the algorithm is applied to some
microlevel (say the pixel level), the human is not able to make
sense of. When human are not able to make sense of the input and
how it is transformed as we do not find any connection or simple
storytelling for it, we start to talk about black-box. After all
I never heard anyone talking about black-box for a regression
although the mathematical ultimate concept between the
"black-box neural networks" and regressions is not that far.
</p>

<p>
I.e. you talk about black-box when the information extracted out
of an object is of no practical use for a human being as we are
not able to make sense of it at any level as we cannot read and
interpret that piece of information.
</p>

<p>
That is the ultimate strength of learning by example and the
reason for the buzz around machine learning. You allow to
extract information out of an entire new set of objects, which a
human being is not able to make any sense of.
</p>

<p>
This is the beauty of machine learning and why it is creating so
much buzz. Not the single individual algorithm. Nor a complex
mathematical formula in itself. This is an idea that a <i>book</i>
can bring you but a <i>textbook</i> cannot - or at least not in the
same way as you need a stronger prolonged stimulus to think in
these term and get out of that micro-level thinking you do in
your routine when applying such things.
</p>

<p>
The issue of these black-box models is then that the human has
to go by trial and error to learn these patterns. We have to try
to analyze some microlevel entity and see how it works. You have
then reached the ultimate pure-black-box level so prone to
overfitting.
</p>

<p>
Finger-crossed: you have no idea of why a result occurred but
you just hope and make some mathematical tricks that should
convince you that your results are generalizable and adversarial
resistant.
</p></li>

<li><p>
about the impossibility to distinguish between procedural
learning and learning by example.
</p>

<p>
interesting is that the meta-level that allows a human to get
the idea of an object, is not known to the human in a procedural
way. Also interesting is that it is not an example driven
deducted idea.
</p>

<p>
You are able to think in abstract terms - say a yellow hydra
with the face of a dog - vs <a href="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT1nGGpfIgXevFXMyR_JFnghK9lAoUeAXeq1u6D8y-k8arlRarloNdoLz4SFyLE-79neRo&amp;usqp=CAU">by example</a>.
</p>

<p>
Or you can get the idea of quadruple out of a cat. This in
contrast to the case of machine learning where in order to learn
the idea of quadruple you would have to re-index and retrain all
of your data and train again a different algorithm for the
task.. you cannot also ask ML to make a generalization out of a
category as it has no idea on how to do that.
</p>

<p>
Interesting is in this sense to see and think about how we human
are not even conscious ourselves about some structures of our
thinking and decision making. We are black-boxes and this is the
ultimate reason why we need psychologists to remember us such a
thing and tell us that it is okey.
</p>

<p>
However, funny is also the way we cannot accept a black-box
object, pretending that each and every human decision is
motivated by pure rational choices. Note that this tendency is
not just in machine learning but it is pretty much installed in
the human brain of any western person as a core and fundamental
fix-point value. 
</p>

<p>
Well, I see that I am starting to go too much into philosophical
discussion. That is dangerous so I will let it and go back to my
micro-level thinking.
</p></li>
</ul></li>

<li><p>
<a href="https://en.wikipedia.org/wiki/The_Life_Before_Us">The Life Before Us</a> (Romain Gary):
</p>

<p>
Nice book. I read it in 10 days but I was rather busy. It is the
book from which the movie - la vita davanti a se - originates. See
above your impressions.
</p>

<p>
If the movie made a good impression and was <i>strong</i>; well the
book is at another level. I loved it. The strength of Momo is
powered to the <i>nth</i>. It is the most beautiful thing: the fact
that despite all of the bad things that can happen in life, when a
heart is good, love will win. No compromises, like Momo always
did, very conscious of his misfortune. It is probably that
consciousness that made bearable the unbearable and forged a
character as strong and pure as the one of Momo. 
</p></li>

<li><p>
<a href="https://www.amazon.com/State-Any-Cost-David-Ben-Gurion/dp/0374112649">A state at any Cost: The Life of David Ben-Gurion</a> (Tom Segev):
</p>

<p>
Well I must say that I agree with the reviews I have read about
the book: not well written.
</p>

<p>
I think that Segev could have been more thoughtful and could
invested more time in organizing his very big research material
and structure a bit more the book. It is way too long, the
language and the way it is written not very engaging. I think that
a common thread is sometimes missing.
</p>

<p>
Despite of all of that, there is interesting things in the
book. First of all the character of Ben-Gurion. What a beautiful
character. Here Segev managed quite well to report the picture of
the battled David character, albeit I think he took some liberty
and biased a little bit the book at times in one direction or the
other.
</p>

<p>
In any case wonderful and charismatic person Ben-Gurion. It is
kind of heart warming reading about the struggles of such a great
person. You see once again that even people that managed great
things in life faced quite some lows and difficulties often
doubting of themselves.
</p>

<p>
Important is to see how in the end no matter how hard he fell -
especially in his youth - he managed to reach his goals. As it is
framed in the book - not because he was an outlier or
high-performer individual but rather because he had a very strong
life purpose and was highly committed to it. Make the plan
explicit and the rest will follow. I must admit that in
comparison to Ben-Gurion I do not have a fix-point or north star
that reaches in any level the one of him. I guess because at the
end I like to take pleasure from small things. But I would like
to fulfill myself in some dimension apart from the general family
affection. Will still have to work on that.
</p>

<p>
In any case going back to Ben-Gurion, one thing that I
particularly like is that he was eating books. He had a curious
mind and it was impressive the amount of interest he could
multi-manage and the amount of books he read. I still remember
when I visited his house - which is now a museum in Tel-Aviv. So
many books. Crazy. In this sense you are improving in time. Of
course you are not at the level but there is some Momentum, which
I hope you will improve in time.
</p>

<p>
Last but not least, I loved the fact that he was holding a
diary. He was obsessed in organizing his thoughts by putting
things in writing. I love it and I must say that here again I am
improving through this Blog. It is a very good exercise and it
helps as well to organize a bit better my life.
</p>

<p>
And then yeah, what to say. It was good refresher of the history
of Israel and what the land means to the Jewish people. What it
cost and how many troubling moments and decisions where on its
way. In this sense, I must say, there is better literature but it
is fine as that was in fact not the purpose of the book.
</p></li>

<li><p>
<a href="https://en.wikipedia.org/wiki/If_This_Is_a_Man">If this is a Man</a> (Primo Levi):
</p>

<p>
It is a couple of years since I read this book. I read a few
others in the meanwhile but I want to write a few notes on
this. Even if notes are not fresh in my memory, what stroke me the
most of this book was its content.
</p>

<p>
I expected some very hash statement. Some deep philosophical
questions. I expected to find all of that and more in the book. I
was surprised. All of that kind of material is left just in the
title of the book. One sentence: <i>if this is a man</i>. Without
answer nor a question mark.
</p>

<p>
That is the power of the book. It is true to itself. It is the
true, naked message. It is the history of what such people had to
live through in concentration camps.
</p>

<p>
It talks about routine. It talks about how the people that
survived managed the routine; just manage the routine with little
escamotage. That is the daily life of all of us. Manage it at the
microlevel conscious about a bigger picture but without giving it
too much importance.
</p>

<p>
And the book follows that pattern. It does not talk at the
macro-level the complete folly of the Nazis. It talks at the
micro-level of the horrible experience of the people.
</p>

<p>
And it leaves the exercise of making sense of it, if at all
possible, to you with that single title: <i>if this is a man</i>.
</p></li>
</ul>
</div>
</div>
