posts/things-to-do-in-zh.org
** Books to Read

   - [[https://www.amazon.com/Learned-Optimism-Martin-P-Seligman/dp/1442341130][Learned Optimism]]

   - [[https://www.orellfuessli.ch/shop/home/artikeldetails/ID28756725.html][Thinking, Fast and Slow]]

   - Books of William Saroyan (recommended by Jonathan Netanyahu in
     his letters).
  

* Theater

  - [[https://www.broadway.com/shows/the-phantom-of-the-opera/][The phantom of the Opera]] (2021)

    Was nice being in broadway. Nice show. Well done. I must admit
    that it was difficult at times for me to follow entirely the
    script. I mean I could well follow the broad plot and always
    understand most of it. But not 100%. This due to the musical
    component of it that was not always easy to follow for a
    non-native English speaker like me. 

    I remember that when I first watched the movie of it during my
    high-school time I was much more struck by the character of
    phantom and especially the end. It was much more of a struggle. I
    cannot understand how much this was missing in the show due to the
    point mentioned above and how much it was inherent in the design
    of the show.

    In any case nice to be in Broadway and to watch a Broadway classic
    was ultimately the goal such that I was very satisfied with it.

  - [[https://www.teatromanzoni.it/manzoni/it/spettacoli/scusa-sono-in-riunione-ti-posso-richiamare-1][Scusa sono in riunione... ti posso richiamare?]] (2021)

    The first part it is extremely nice. Very funny and at the same
    time very true.

    It talks about the life of all of us. The natural leitmotiv of our
    societies. How each and everyone of us follows in that bit and how
    in a funny way we become funny caricatures of societies schemas.

    The second part is a little bit random.. still funny at times. But
    it looses that part of reality that was in the first bit. In the
    first part the story is of the public. I.e. the actors in play
    represent each and everyone of us. I.e. in their story there is as
    well /our/ story. In the second part that relation bit
    disappears. It becomes /their/ story.

    The message at the end is nice. It tells you *not* to enter in
    that rabbit hole as Luciano did. To renounce - in order to keep
    your integrity. 


* Interesting Artists

(As of 15/12/2020)

- Michael Kachan (A)

- Vaca Mia Brintrup (A)

- Debbie Miller (B)

Others

- Doug Quillinan

- Antonio Sotomayor 

- Gregory Radionov (just water colours)

- Charles Levier

- Victor Coleman Anderson 

- Alexander Raymond Katz

- Sviatoslav Baziuk 

- Ruth Owens - How? 2017


* Travels/ Out of home door Activities

** Switzerland

*** Zurich

**** Museums

   - [[https://www.zuerich.com/en/visit/culture/museum-rietberg#internal][intercultural museum]] (B)

   - [[https://www.zuerich.com/en/visit/culture/zaz-bellerive#internal][space and urbanism museum]] (C)

   - [[https://www.kulturama.ch/][anatomy/biology museum]] (B)

**** Park 

   - [[http://www.weinrebenpark.ch/][bruno weber park]]. (A)

   - [[https://www.atlasobscura.com/places/mfo-park][oerlikon.. some weird plants go to take a look once you pass by]] (C)

   - [[https://www.atlasobscura.com/places/villa-patumbah][colonial villa in ZH]] ([[https://www.heimatschutzzentrum.ch/index.php?id=2239][link2]]) (B)

**** Sommergarten

   Probiere noch 
 
    - [[https://zumfrischenmax.ch/][zumfrischenmax]] - done after tutanchamon; ok nothing special -
 
    - das neue gerold's [[https://www.fraugerold.ch/de/guggach][garten in Bucheggplatz]].

**** Bar

   - [[https://www.zuerich.com/en/visit/restaurants/samigo-amusement#internal][chic bar with other friends]] (C)
 
   - [[https://www.atlasobscura.com/places/oepfelchammer][funny bar with friends]] (B) - done - 

   - nice bar [[https://www.zuerich.com/en/visit/nightlife/regenbogen-bar][im Niederdorf]] (B) - nice in summer funny live music on tuesdays -

*** Hikes

  - [[https://www.grimselwelt.ch/en/excursion-tips/trift][trift bridge hike]] (AA)


** Italy 

  - [[https://en.wikipedia.org/wiki/Villa_di_Pratolino][villa demidoff]] (B)

  - [[https://it.wikipedia.org/wiki/Lago_di_Carezza][lago dell'arcobaleno]] (A) - non balneabile solo per passeggiate tirolo.

  - [[https://www.camminatorianonimi.com/2020/07/11/alla-quercia-delle-streghe/][la quercia delle streghe]] (A) - passeggiata con sorpresa in toscana


*** Milano

**** Stazione Centrale 

   - [[https://www.atlasobscura.com/places/royal-pavilion-at-stazione-centrale][Stanze d'attesa reali]] (A)


** London

*** Open Air

  - [[https://www.atlasobscura.com/places/banksy-s-designated-graffiti-area][graffiti]] (A)

  - [[https://www.atlasobscura.com/places/greenwich-foot-tunnel][canary wharf activity]] - nothing big. if you should be there by
    chance with some time left. (C)

  - [[https://www.london-walking-tours.co.uk/the-seven-noses-of-soho.htm][funny activity.... can you find the noses]] ([[https://www.google.com/maps/d/u/0/viewer?msa=0&dg=feature&mid=1g06yOJHD6OORLaAM2IMKHeMtUDc&ll=51.512889089653505%2C-0.12930900000003298&z=15][use this map]]) (B)

*** Indoor

  - [[https://fotostrasse.com/london-canal-museum-kings-cross-ice-well/][London canal museum and ice well]] (C)

  - [[https://secretldn.com/growing-underground-farm/][Growing underground]] (C)

  - [[https://www.janewildgoose.co.uk/about_the_library.html][weird library / place]] (A)

  - [[https://www.soane.org/?gclid=Cj0KCQjw1qL6BRCmARIsADV9JtbFChEEtDysN4sajeI-cv-o_GN93lFT9AbRSD3a_cSKAi-rgseWs4MaAj81EALw_wcB][Sir John Soane's Museum]] - messy antiquities place (A)


** Israel

  - [[https://www.ilanagoormuseum.org/en/][ilana goor museum. yaffo - looks nice]] (B)

  - [[https://jonathanmtsai.wordpress.com/2010/11/19/hermits-house-herzliya/][heremit's house in herzliya]] (AA)

  - [[http://en.goramla.com/category/pool-of-arches][the pool of arches in Ramla]] (A)




