cache/posts/things-to-do-in-zh.html


<div id="outline-container-orgecd23c2" class="outline-3">
<h3 id="orgecd23c2">Books to Read</h3>
<div class="outline-text-3" id="text-orgecd23c2">
<ul class="org-ul">
<li><a href="https://www.amazon.com/Learned-Optimism-Martin-P-Seligman/dp/1442341130">Learned Optimism</a></li>

<li><a href="https://www.orellfuessli.ch/shop/home/artikeldetails/ID28756725.html">Thinking, Fast and Slow</a></li>

<li>Books of William Saroyan (recommended by Jonathan Netanyahu in
his letters).</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org746cf13" class="outline-2">
<h2 id="org746cf13">Theater</h2>
<div class="outline-text-2" id="text-org746cf13">
<ul class="org-ul">
<li><p>
<a href="https://www.broadway.com/shows/the-phantom-of-the-opera/">The phantom of the Opera</a> (2021)
</p>

<p>
Was nice being in broadway. Nice show. Well done. I must admit
that it was difficult at times for me to follow entirely the
script. I mean I could well follow the broad plot and always
understand most of it. But not 100%. This due to the musical
component of it that was not always easy to follow for a
non-native English speaker like me. 
</p>

<p>
I remember that when I first watched the movie of it during my
high-school time I was much more struck by the character of
phantom and especially the end. It was much more of a struggle. I
cannot understand how much this was missing in the show due to the
point mentioned above and how much it was inherent in the design
of the show.
</p>

<p>
In any case nice to be in Broadway and to watch a Broadway classic
was ultimately the goal such that I was very satisfied with it.
</p></li>

<li><p>
<a href="https://www.teatromanzoni.it/manzoni/it/spettacoli/scusa-sono-in-riunione-ti-posso-richiamare-1">Scusa sono in riunione&#x2026; ti posso richiamare?</a> (2021)
</p>

<p>
The first part it is extremely nice. Very funny and at the same
time very true.
</p>

<p>
It talks about the life of all of us. The natural leitmotiv of our
societies. How each and everyone of us follows in that bit and how
in a funny way we become funny caricatures of societies schemas.
</p>

<p>
The second part is a little bit random.. still funny at times. But
it looses that part of reality that was in the first bit. In the
first part the story is of the public. I.e. the actors in play
represent each and everyone of us. I.e. in their story there is as
well <i>our</i> story. In the second part that relation bit
disappears. It becomes <i>their</i> story.
</p>

<p>
The message at the end is nice. It tells you <b>not</b> to enter in
that rabbit hole as Luciano did. To renounce - in order to keep
your integrity. 
</p></li>
</ul>
</div>
</div>


<div id="outline-container-orgc4c0a2a" class="outline-2">
<h2 id="orgc4c0a2a">Interesting Artists</h2>
<div class="outline-text-2" id="text-orgc4c0a2a">
<p>
(As of 15/12/2020)
</p>

<ul class="org-ul">
<li>Michael Kachan (A)</li>

<li>Vaca Mia Brintrup (A)</li>

<li>Debbie Miller (B)</li>
</ul>

<p>
Others
</p>

<ul class="org-ul">
<li>Doug Quillinan</li>

<li>Antonio Sotomayor</li>

<li>Gregory Radionov (just water colours)</li>

<li>Charles Levier</li>

<li>Victor Coleman Anderson</li>

<li>Alexander Raymond Katz</li>

<li>Sviatoslav Baziuk</li>

<li>Ruth Owens - How? 2017</li>
</ul>
</div>
</div>


<div id="outline-container-org8a17c4c" class="outline-2">
<h2 id="org8a17c4c">Travels/ Out of home door Activities</h2>
<div class="outline-text-2" id="text-org8a17c4c">
</div>
<div id="outline-container-org0d69339" class="outline-3">
<h3 id="org0d69339">Switzerland</h3>
<div class="outline-text-3" id="text-org0d69339">
</div>
<div id="outline-container-org49d3861" class="outline-4">
<h4 id="org49d3861">Zurich</h4>
<div class="outline-text-4" id="text-org49d3861">
</div>
<ul class="org-ul">
<li><a id="org7c3caf8"></a>Museums<br />
<div class="outline-text-5" id="text-org7c3caf8">
<ul class="org-ul">
<li><a href="https://www.zuerich.com/en/visit/culture/museum-rietberg#internal">intercultural museum</a> (B)</li>

<li><a href="https://www.zuerich.com/en/visit/culture/zaz-bellerive#internal">space and urbanism museum</a> (C)</li>

<li><a href="https://www.kulturama.ch/">anatomy/biology museum</a> (B)</li>
</ul>
</div>
</li>

<li><a id="org0ed29fe"></a>Park<br />
<div class="outline-text-5" id="text-org0ed29fe">
<ul class="org-ul">
<li><a href="http://www.weinrebenpark.ch/">bruno weber park</a>. (A)</li>

<li><a href="https://www.atlasobscura.com/places/mfo-park">oerlikon.. some weird plants go to take a look once you pass by</a> (C)</li>

<li><a href="https://www.atlasobscura.com/places/villa-patumbah">colonial villa in ZH</a> (<a href="https://www.heimatschutzzentrum.ch/index.php?id=2239">link2</a>) (B)</li>
</ul>
</div>
</li>

<li><a id="orgcc04f07"></a>Sommergarten<br />
<div class="outline-text-5" id="text-orgcc04f07">
<p>
Probiere noch 
</p>

<ul class="org-ul">
<li><a href="https://zumfrischenmax.ch/">zumfrischenmax</a> - done after tutanchamon; ok nothing special -</li>

<li>das neue gerold's <a href="https://www.fraugerold.ch/de/guggach">garten in Bucheggplatz</a>.</li>
</ul>
</div>
</li>

<li><a id="org5a22014"></a>Bar<br />
<div class="outline-text-5" id="text-org5a22014">
<ul class="org-ul">
<li><a href="https://www.zuerich.com/en/visit/restaurants/samigo-amusement#internal">chic bar with other friends</a> (C)</li>

<li><a href="https://www.atlasobscura.com/places/oepfelchammer">funny bar with friends</a> (B) - done -</li>

<li>nice bar <a href="https://www.zuerich.com/en/visit/nightlife/regenbogen-bar">im Niederdorf</a> (B) - nice in summer funny live music on tuesdays -</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org60a9512" class="outline-4">
<h4 id="org60a9512">Hikes</h4>
<div class="outline-text-4" id="text-org60a9512">
<ul class="org-ul">
<li><a href="https://www.grimselwelt.ch/en/excursion-tips/trift">trift bridge hike</a> (AA)</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org59300ac" class="outline-3">
<h3 id="org59300ac">Italy</h3>
<div class="outline-text-3" id="text-org59300ac">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Villa_di_Pratolino">villa demidoff</a> (B)</li>

<li><a href="https://it.wikipedia.org/wiki/Lago_di_Carezza">lago dell'arcobaleno</a> (A) - non balneabile solo per passeggiate tirolo.</li>

<li><a href="https://www.camminatorianonimi.com/2020/07/11/alla-quercia-delle-streghe/">la quercia delle streghe</a> (A) - passeggiata con sorpresa in toscana</li>
</ul>
</div>


<div id="outline-container-orga882faa" class="outline-4">
<h4 id="orga882faa">Milano</h4>
<div class="outline-text-4" id="text-orga882faa">
</div>
<ul class="org-ul">
<li><a id="org65fabb0"></a>Stazione Centrale<br />
<div class="outline-text-5" id="text-org65fabb0">
<ul class="org-ul">
<li><a href="https://www.atlasobscura.com/places/royal-pavilion-at-stazione-centrale">Stanze d'attesa reali</a> (A)</li>
</ul>
</div>
</li>
</ul>
</div>
</div>


<div id="outline-container-org4b6ae47" class="outline-3">
<h3 id="org4b6ae47">London</h3>
<div class="outline-text-3" id="text-org4b6ae47">
</div>
<div id="outline-container-orgaea5614" class="outline-4">
<h4 id="orgaea5614">Open Air</h4>
<div class="outline-text-4" id="text-orgaea5614">
<ul class="org-ul">
<li><a href="https://www.atlasobscura.com/places/banksy-s-designated-graffiti-area">graffiti</a> (A)</li>

<li><a href="https://www.atlasobscura.com/places/greenwich-foot-tunnel">canary wharf activity</a> - nothing big. if you should be there by
chance with some time left. (C)</li>

<li><a href="https://www.london-walking-tours.co.uk/the-seven-noses-of-soho.htm">funny activity&#x2026;. can you find the noses</a> (<a href="https://www.google.com/maps/d/u/0/viewer?msa=0&amp;dg=feature&amp;mid=1g06yOJHD6OORLaAM2IMKHeMtUDc&amp;ll=51.512889089653505%2C-0.12930900000003298&amp;z=15">use this map</a>) (B)</li>
</ul>
</div>
</div>

<div id="outline-container-org05bf5f3" class="outline-4">
<h4 id="org05bf5f3">Indoor</h4>
<div class="outline-text-4" id="text-org05bf5f3">
<ul class="org-ul">
<li><a href="https://fotostrasse.com/london-canal-museum-kings-cross-ice-well/">London canal museum and ice well</a> (C)</li>

<li><a href="https://secretldn.com/growing-underground-farm/">Growing underground</a> (C)</li>

<li><a href="https://www.janewildgoose.co.uk/about_the_library.html">weird library / place</a> (A)</li>

<li><a href="https://www.soane.org/?gclid=Cj0KCQjw1qL6BRCmARIsADV9JtbFChEEtDysN4sajeI-cv-o_GN93lFT9AbRSD3a_cSKAi-rgseWs4MaAj81EALw_wcB">Sir John Soane's Museum</a> - messy antiquities place (A)</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgd155a55" class="outline-3">
<h3 id="orgd155a55">Israel</h3>
<div class="outline-text-3" id="text-orgd155a55">
<ul class="org-ul">
<li><a href="https://www.ilanagoormuseum.org/en/">ilana goor museum. yaffo - looks nice</a> (B)</li>

<li><a href="https://jonathanmtsai.wordpress.com/2010/11/19/hermits-house-herzliya/">heremit's house in herzliya</a> (AA)</li>

<li><a href="http://en.goramla.com/category/pool-of-arches">the pool of arches in Ramla</a> (A)</li>
</ul>
</div>
</div>
</div>
